RhinoInside.Revit API Documentation
ColorConverter.ToColor Method (Color)
 Converts the specified Color to an equivalent Autodesk.Revit.DB.Color.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Color ToColor(
	this Color color
)
@staticmethod
def ToColor(
	color: Color
) -> Autodesk.Revit.DB.Color
Parameters
color
Type: System.Drawing.Color
System color to convert.
Return Value
Type: Autodesk.Revit.DB.Color
Revit color that is equivalent to the provided System color.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToColor(Color) as extension method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.Color revitColor = color.ToColor();
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.System.Drawing)
revit_color = color.ToColor()    # type: DB.Color
 Using ToColor(Color) as static method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.Color revitColor = ColorConverter.ToColor(color)
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
clr.AddReference("Eto")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing.ColorConverter as CC
revit_color = CC.ToColor(color)    # type: DB.Color
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.System.Drawing Namespace